In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Column1":[1,2,3,4,5,6],
    "Column2":[100,100,200,300,300,100],
    "Column3":["Yasin","Sinan","Sagopa","Hidra","kolera","salvo"]
})

In [3]:
df

   Column1  Column2 Column3
0        1      100   Yasin
1        2      100   Sinan
2        3      200  Sagopa
3        4      300   Hidra
4        5      300  kolera
5        6      100   salvo

In [4]:
df.head()

   Column1  Column2 Column3
0        1      100   Yasin
1        2      100   Sinan
2        3      200  Sagopa
3        4      300   Hidra
4        5      300  kolera

In [5]:
df["Column2"].unique()

array([100, 200, 300], dtype=int64)

In [6]:
df["Column2"].nunique()

3

In [7]:
df["Column2"].value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [8]:
df[(df["Column1"] > 2) & (df["Column2"] == 300)]

   Column1  Column2 Column3
3        4      300   Hidra
4        5      300  kolera

In [9]:
def times3(x):
    return x * 3

In [10]:
df["Column2"].apply(times3)

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [11]:
df["Column3"].apply(len)

0    5
1    5
2    6
3    5
4    6
5    5
Name: Column3, dtype: int64

In [12]:
df["Column2"].apply(lambda x : x *2 )

0    200
1    200
2    400
3    600
4    600
5    200
Name: Column2, dtype: int64

In [13]:
df.drop("Column1",axis = 1,inplace = True)

In [14]:
df

   Column2 Column3
0      100   Yasin
1      100   Sinan
2      200  Sagopa
3      300   Hidra
4      300  kolera
5      100   salvo

In [15]:
df.columns

Index(['Column2', 'Column3'], dtype='object')

In [16]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [17]:
df.index.names

FrozenList([None])

In [18]:
len(df.index)

6

In [19]:
df

   Column2 Column3
0      100   Yasin
1      100   Sinan
2      200  Sagopa
3      300   Hidra
4      300  kolera
5      100   salvo

In [20]:
df.sort_values("Column2")

   Column2 Column3
0      100   Yasin
1      100   Sinan
5      100   salvo
2      200  Sagopa
3      300   Hidra
4      300  kolera

In [21]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Şehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [22]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75

In [23]:
df.pivot_table(index = "Şehir",columns ="Ay",values = "Nem")

Ay        Mart  Mayıs  Nisan
Şehir
Ankara      10     50     25
İstanbul    21     80     67
İzmir       30     75     70

In [24]:
df.pivot_table(index = "Ay",columns ="Şehir",values = "Nem")

Şehir  Ankara  İstanbul  İzmir
Ay
Mart       10        21     30
Mayıs      50        80     75
Nisan      25        67     70

In [25]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75